const { Gem, Crown } = require("lucide-react");

export const PLANS = [
  {
    id: "silver",
    name: "اشتراک ویژه",
    price: "۱۰۰۰۰۰ تومان",
    features: [
      "ساخت حداکثر ۳ صفحه",
      "استفاده از تم های گوناگون",
      "شخصی سازی بلوک ها",
      "زمان بندی نمایش محتوا",
      "ایجاد فرم",
      "گزارش گیری از فرم ها",
      "مشاهده آمار کاربران",
      "ثبت در گوگل",
      "شخصی سازی لینک صفحه شخصی شما در شبکه های اجتماعی",
      "دسترسی به بلوک های پیشرفته",
      "ساخت گالری عکس",
    ],
    icon: <Gem className="h-6 w-6 text-gray-400" />,
  },
  // {
  //   id: "gold",
  //   name: "اشتراک طلایی",
  //   price: "۲۰۰۰۰۰ تومان",
  //   features: [
  //     "دسترسی نامحدود به فرم‌ها",
  //     "پشتیبانی ویژه",
  //     "تم‌های سفارشی نامحدود",
  //     "ابزارهای پیشرفته",
  //   ],
  //   icon: <Crown className="h-6 w-6 text-yellow-400" />,
  // },
];
